app/controllers/admin/dashboards_controller.rb

SELECT  `plans`.* FROM `plans`   ORDER BY `plans`.`updated_at` ASC LIMIT 25 OFFSET 0
SELECT  `static_pages`.* FROM `static_pages`   ORDER BY `static_pages`.`updated_at` ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `static_pages`
SELECT  `templates`.* FROM `templates`   ORDER BY `templates`.`updated_at` ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `templates`
---
  def index
    @plans = Plan.order(:updated_at).page(params[:page])
    @static_pages = StaticPage.order(:updated_at).page(params[:page])
    @templates = Template.order(:updated_at).page(params[:page])