app/controllers/admin/plans_controller.rb

SELECT  `plans`.* FROM `plans`   ORDER BY `plans`.`updated_at` ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `plans`
---
  def index
    @plans = Plan.order(:updated_at).page(params[:page])