app/controllers/flyers_controller.rb

SELECT  `templates`.* FROM `templates`  WHERE `templates`.`id` = 1 LIMIT 1
INSERT INTO `flyers` (`created_at`, `updated_at`, `user_id`) VALUES ('2014-09-21 19:42:53', '2014-09-21 19:42:53', 1)
---
  def personalize
    @template = Template.find(params[:id])
    @flyer = current_user.flyers.create(flyer_params(make_params ( @template.template_properties )))