app/controllers/subscriptions_controller.rb

  def new
    @subscription = Subscription.new
    @subscription.plan = Plan.find(params[:plan_id])
---
SELECT  `plans`.* FROM `plans`  WHERE `plans`.`id` = 2 LIMIT 1